<template>
    <div class="xl:w-[1280px] xl:mx-auto px-2 md:px-4 xl:px-10 mt-[100px] md:mt-[170px] lg:mt-50 text-[15px] md:text-[24px] lg:text-[18px] flex flex-col gap-10 md:gap-15 lg:gap-10">
        <h1 ref="main" class="text-[46px] md:text-[85px] lg:text-[63px] font-semibold 
        leading-12 md:leading-20 lg:leading-16">ПРАВИЛА ПОЛЬЗОВАНИЯ ИНТЕРНЕТ-САЙТОМ</h1>
        
        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">1. ОСНОВНЫЕ ПОНЯТИЯ</h2>

            <div>
                Администрация Сайта – организация, владеющая сайтом. Владельцем сайта является ООО «ПОГОДА-АВТО» (ИНН 7321013043, ОГРН 1207300012380).
            </div>

            <div>
                Сайт – сайт, расположенный в сети Интернет по адресу https://barneshouse73.ru.
            </div>

            <div>
                Пользователь – пользователь Сайта, зарегистрированный в установленном порядке.
            </div>
        </div>
        
        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[30px] md:text-[60px] lg:text-[45px] font-semibold">2. СТАТУС ПРАВИЛ</h2>

            <div>
                2.1. Настоящие Правила представляют собой соглашение между Администрацией интернет-сайта https://barneshouse73.ru(далее – Сайт) ООО «ПОГОДА-АВТО» (ИНН 7321013043, ОГРН 1207300012380) (далее – Администрация Сайта) и Пользователем (далее вместе именуемые «Стороны») и регулируют права и обязанности Администрации Сайта и Пользователя в связи с использованием Сайта.
            </div>

            <div>
                2.2. Действующая редакция Правил, являющихся публичным документом, разработана Администрацией Сайта и доступна любому пользователю сети Интернет при переходе по гипертекстовой ссылке «Правила пользования сайтом». Администрация Сайта вправе вносить изменения в настоящие Правила. При внесении изменений в Правила Администрация Сайта уведомляет об этом пользователей путем размещения новой редакции Правил на Сайте по гипертекстовой ссылке «Правила пользования сайтом».
            </div>

            <div>
                2.3. Настоящее соглашение имеет статус сделки в виде публичного договора (далее — Договор). Оно содержит все существенные условия предоставления услуг и имеет соответствующую юридическую силу.
            </div>

            <div>
                2.4. Пользователь обязан время от времени проверять текущую версию настоящих Правил на предмет внесения изменений и/или дополнений. Продолжение использования Сайта Пользователем после вступления в силу соответствующих изменений настоящих Правил означает принятие и согласие Пользователя с такими изменениями и/или дополнениями.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[30px] md:text-[60px] lg:text-[45px] font-semibold">3. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>

            <div>
                3.1. Пользователь обязан ознакомиться с настоящими Правилами регистрации на Сайте. При несогласии с положениями указанных документов Пользователь обязан воздержаться использования Сайта.
            </div>

            <div>
                3.2. Запрещается использование каких-либо автоматических скриптов («программы-роботы») или иных средств, позволяющих взаимодействовать с Сайтом без участия Пользователя. Запрещается совершать действия, направленные на нарушение нормального функционирования Сайта, и использовать специальные программы, содержащие вредоносные компоненты («вирусы»).
            </div>

            <div>
                3.3. Администрация Сайта вправе в любое время вносить изменения в функционал Сайта, интерфейс и/или содержание Сайта с уведомлением Пользователей или без такового.
            </div>

            <div>
                3.4. Администрация Сайта вправе в одностороннем порядке устанавливать стоимость отдельных сервисов, предлагаемых Сайтом. Пользователь обязуется добросовестно использовать способы пополнения личного счета Пользователя на Сайте. При обнаружении Администрацией Сайта фактов неправомерного пополнения личного счета Пользователя Администрация Сайта вправе отказать Пользователю в дальнейшем предоставлении услуг либо в одностороннем порядке уменьшить личный счет Пользователя Сайта.
            </div>

            <div>
                3.5. Администрация Сайта вправе запросить и использовать информацию о Пользователе исключительно в целях предоставления услуг по использованию Сайта.
            </div>

            <div>
                3.6. Администрация Сайта обязана обеспечить техническую поддержку Сайта и предоставить простой способ связи для обращений Пользователей по всем возникающим в процессе использования Сайта вопросам.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[30px] md:text-[60px] lg:text-[45px] font-semibold">4. ИНТЕЛЛЕКТУАЛЬНАЯ СОБСТВЕННОСТЬ</h2>

            <div>
                4.1. Пользователь признает, что Сайт, его интерфейс и содержание (включая, но не ограничиваясь, элементы дизайна, текст, графические изображения, иллюстрации, видео, скрипты, программы, музыка, звуки и другие объекты и их подборки, связанные с Сайтом) защищены авторским правом, товарными знаками, патентами и иными правами, которые принадлежат Администрации Сайта или иным законным правообладателям.
            </div>

            <div>
                4.2. Пользователь не вправе воспроизводить, копировать, изменять, уничтожать, перерабатывать (включая выполнение любого перевода или локализации), продавать, сдавать в прокат, опубликовывать, скачивать, иным образом распространять Сайт либо его компоненты, декомпилировать или иным образом пытаться извлечь исходный код компонентов Сайта, являющихся программным обеспечением, а также изменять функционал Сайта без предварительного письменного согласия Администрации Сайта.
            </div>

            <div>
                4.3. Пользователь не вправе удалять и/или изменять какую-либо информацию, размещенную Администрацией Сайта в рамках Сайта, в том числе знаки охраны авторского права и средств индивидуализации.
            </div>

            <div>
                4.4. Если иное явным образом не установлено в настоящих Правилах, ничто в настоящих Правилах не может быть рассмотрено как передача исключительных прав на Сайт и/или его компоненты Пользователю.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[30px] md:text-[60px] lg:text-[45px] font-semibold">5. ГАРАНТИИ И ОТВЕТСТВЕННОСТЬ</h2>

            <div>
                5.1. Пользователь признает и соглашается с тем, что Сайт предоставляется на условиях «как есть». Администрация Сайта не предоставляет гарантий в отношении последствий использования Сайта, взаимодействия Сайта с другим программным обеспечением.
            </div>

            <div>
                5.2. Администрация Сайта не предоставляет гарантий того, что Сайт может подходить для конкретных целей использования. Пользователь признает и соглашается с тем, что результат использования Сайта может не соответствовать ожиданиям Пользователя.
            </div>

            <div>
                5.3. Администрация Сайта или иные правообладатели ни при каких обстоятельствах не несут ответственность за любой косвенный, случайный, неумышленный ущерб (включая упущенную выгоду, ущерб, причиненный утратой данных), вызванный в связи с использованием Сайта или невозможностью его использования, в том числе в случае отказа работы Сайта или иного перерыва в использовании Сайта, даже если Администрация Сайта предупреждала или указывала на возможность такого ущерба.
            </div>

            <div>
                5.4. Пользователь самостоятельно несет ответственность за свои действия по использованию Сайта, в том числе за действия по размещению и передаче информации, комментариев, изображений и иных материалов другим Пользователям с помощью Сайта. Пользователь самостоятельно несет ответственность за соблюдение прав третьих лиц, применимого законодательства, настоящих Правил, при использовании Сайта.
            </div>

            <div>
                5.5. За нарушения, допущенные Пользователем, Администрация Сайта вправе отказать Пользователю в дальнейшем предоставлении услуг или ограничить такое предоставление полностью или частично с уведомлением Пользователя или без такового.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[30px] md:text-[60px] lg:text-[45px] font-semibold">6. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>

            <div>
                6.1. Администрация Сайта вправе в любой момент приостанавливать или прекращать функционирование Сайта с уведомлением Пользователей или без такового.
            </div>

            <div>
                6.2. Настоящие Правила регулируются и толкуются в соответствии с законодательством. Вопросы, не урегулированные Правилами, подлежат разрешению в соответствии с законодательством.
            </div>

            <div>
                6.3. В случае возникновения любых споров или разногласий, связанных с исполнением настоящих Правил, Администрация Сайта и Пользователь приложат все усилия для их разрешения путем проведения переговоров между ними. В случае, если споры не будут разрешены путем переговоров, споры подлежат разрешению в порядке, установленном действующим законодательством.
            </div>

            <div>
                6.4. Если по тем или иным причинам одно или несколько положений настоящих Правил будут признаны недействительными или не имеющими юридической силы, это не оказывает влияния на действительность или применимость остальных положений.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[30px] md:text-[60px] lg:text-[45px] font-semibold">7. СОГЛАСИЕ НА ОБРАБОТКУ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

            <div>
                7.1. В связи с необходимостью выполнения требований Закона «О защите персональных данных» от 01.06.2010 г. № 2297-VI и условий настоящего Договора, Пользователь дает свое согласие на обработку Сайтом своих персональных данных.
            </div>

            <div>
                7.2. Сайт обязуется обрабатывать персональные данные Пользователя в строгом соответствии с законодательством о защите персональных данных.
            </div>

            <div>
                7.3. Разрешение на обработку персональных данных действует в течение всего срока действия Договора.
            </div>

            <div>
                7.4. Пользователь соглашается с тем, что Сайт имеет право предоставлять доступ и передавать его персональные данные третьим лицам без каких-либо дополнительных уведомлений Пользователя, не изменяя при этом цель обработки персональных данных.
            </div>

            <div>
                7.5. Пользователь согласен, что его cookies запоминаются на сайте путем сохранения пользовательских настроек и анализа поведения пользователя на сайте с целью повышения качества предоставления услуг. Пользователь имеет право отключить использование файлов cookie в своем браузере. При этом он соглашается с тем, что некоторые функции сайта могут работать неправильно.
            </div>
        </div>
    </div>
</template>

<script setup>

</script>